byYorick/mesh_hydro/node_ph_ec/sdkconfig.defaults
# ════════════════════════════════════════════════════════
# NODE pH/EC - ESP32-S3 Configuration
# ════════════════════════════════════════════════════════

# Target
CONFIG_IDF_TARGET="esp32s3"

# Mesh
CONFIG_ESP_WIFI_MESH_SUPPORT=y

# WiFi
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=1
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=n
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=n

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n

# Log
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3

# Main task
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Watchdog - ОТКЛЮЧЁН для отладки
CONFIG_ESP_TASK_WDT=n

# ESP32-S3 specific
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
